Revit 2027 API
ViewShapeBuilder.ValidateShape Method
 Validates a shape represented as a collection of geometry objects for use as a view-specific shape. The objects are expected to be either points, curves or polylines. Curves are expected to be flat and lie in a plane perpendicular to view normal as defined by view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ValidateShape(
	IList<GeometryObject> shape,
	DirectShapeTargetViewType targetViewType
)
Public Shared Function ValidateShape (
	shape As IList(Of GeometryObject),
	targetViewType As DirectShapeTargetViewType
) As Boolean
public:
static bool ValidateShape(
	IList<GeometryObject^>^ shape,
	DirectShapeTargetViewType targetViewType
)
static member ValidateShape :
        shape : IList<GeometryObject> *
        targetViewType : DirectShapeTargetViewType -> bool
Parameters
shape IList<GeometryObject>
targetViewType DirectShapeTargetViewType
Return Value
Boolean
 Returns true if %shape% may be used as a view-specific shape representation, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  targetViewType is not DirectShapeTargetViewType::Plan
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace